9/data/attachments/2cea4b3655891cdb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_0fd1a867-3ee0-4023-b238-56d034f09df9</nif:username>
            <nif:friendToBeAdded>Randall_along_Friend_29929_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>